wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_adc.h
/**
  ******************************************************************************
  * @file    fm33l0xx_adc.h
  * @author  FM33l0xx Application Team
  * @version V0.1.0
  * @date    12-Jun-2019
  * @brief   This file contains all the functions prototypes for the ADC firmware library.  
  ******************************************************************************
  */
  
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __FM33L0XX_ADC_H
#define __FM33L0XX_ADC_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

#include "FM33L0XX.h" 

#define	ADC_ISR_AWD_AH_Pos	6	/* 模拟看门狗超出上限中断标志 (Analog Watchdog Above High Threshold)当采样值高于AWD_HT时，硬件置位，软件写1清零. */
#define	ADC_ISR_AWD_AH_Msk	(0x1U << ADC_ISR_AWD_AH_Pos)

#define	ADC_ISR_AWD_UL_Pos	5	/* 模拟看门狗低于下限中断标志 (Analog Watchdog Under Low Threshold)当采样值低于AWD_LT时，硬件置位，软件写1清零 */
#define	ADC_ISR_AWD_UL_Msk	(0x1U << ADC_ISR_AWD_UL_Pos)

#define	ADC_ISR_EOCAL_Pos	4	/* 校准结束 (End Of Calibration)硬件置位，软件写1清零1：校准过程结束0：无校准过程 */
#define	ADC_ISR_EOCAL_Msk	(0x1U << ADC_ISR_EOCAL_Pos)

#define	ADC_ISR_BUSY_Pos	3	/* ADC忙标志 (Busy) 1：ADC正在校准、采样或转换过程中 0：ADC空闲 */
#define	ADC_ISR_BUSY_Msk	(0x1U << ADC_ISR_BUSY_Pos)

#define	ADC_ISR_OVR_Pos	2	/* 数据冲突标志，硬件置位，软件写1清零 (Over Run) 当ADC_DATA寄存器中的上一次转换结果还未被读取，新的转换结果又到来时，硬件置位OVR标志。0：没有数据冲突 1：出现数据冲突 */
#define	ADC_ISR_OVR_Msk	(0x1U << ADC_ISR_OVR_Pos)

#define	ADC_ISR_EOS_Pos	1	/* 转换序列结束 (End Of Sequence)所有使能通道都转换完成后，置位EOS，软件写1清零。 */
#define	ADC_ISR_EOS_Msk	(0x1U << ADC_ISR_EOS_Pos)

#define	ADC_ISR_EOC_Pos	0	/* 单次转换结束 (End Of Conversion)每个通道转换完成后，置位EOC，软件写1清零。 */
#define	ADC_ISR_EOC_Msk	(0x1U << ADC_ISR_EOC_Pos)

#define	ADC_IER_AWD_AHIE_Pos	6	/* 模拟看门狗采样值高于上限中断使能，1有效 (Analog Watchdog Above High Threshold Interrupt Enable) */
#define	ADC_IER_AWD_AHIE_Msk	(0x1U << ADC_IER_AWD_AHIE_Pos)

#define	ADC_IER_AWD_ULIE_Pos	5	/* 模拟看门狗采样值低于上限中断使能，1有效 (Analog Watchdog Under Low Threshold Interrupt Enable) */
#define	ADC_IER_AWD_ULIE_Msk	(0x1U << ADC_IER_AWD_ULIE_Pos)

#define	ADC_IER_EOCALIE_Pos	4	/* 校准结束中断使能寄存器 (End Of Calibration Interrupt Enable) 0：禁止EOCAL中断 1：允许EOCAL中断 */
#define	ADC_IER_EOCALIE_Msk	(0x1U << ADC_IER_EOCALIE_Pos)

#define	ADC_IER_OVRIE_Pos	2	/* 数据冲突中断使能寄存器 (Over Run Interrupt Enable) 0：禁止数据冲突中断 1：允许数据冲突中断 */
#define	ADC_IER_OVRIE_Msk	(0x1U << ADC_IER_OVRIE_Pos)

#define	ADC_IER_EOSIE_Pos	1	/* 转换序列结束中断使能寄存器 (End Of Sequence Interrupt Enable) 0：禁止EOS中断 1：允许EOS中断 */
#define	ADC_IER_EOSIE_Msk	(0x1U << ADC_IER_EOSIE_Pos)

#define	ADC_IER_EOCIE_Pos	0	/* 单次转换结束中断使能寄存器 (End Of Conversion Interrupt Enable) 0：禁止EOC中断 1：允许EOC中断 */
#define	ADC_IER_EOCIE_Msk	(0x1U << ADC_IER_EOCIE_Pos)

#define	ADC_CR_START_Pos	1	/* ADC启动转换寄存器，软件写1启动，硬件自动清零。 */
#define	ADC_CR_START_Msk	(0x1U << ADC_CR_START_Pos)

#define	ADC_CR_ADEN_Pos	0	/* ADC使能寄存器 (ADC Enable) 在启动转换前先要置位ADEN，等待至少5个MCLK后再启动转换。0：关闭ADC 1：使能ADC */
#define	ADC_CR_ADEN_Msk	(0x1U << ADC_CR_ADEN_Pos)

#define	ADC_CFGR_CKS_Pos	30	/* ADC工作时钟选择 (ADC Clock Select) */
#define	ADC_CFGR_CKS_Msk	(0x3U << ADC_CFGR_CKS_Pos)
#define	ADC_CFGR_CKS_ADCCLK	(0x0U << ADC_CFGR_CKS_Pos)	/* 00：ADCCLK */
#define	ADC_CFGR_CKS_APBCLK_2	(0x1U << ADC_CFGR_CKS_Pos)	/* 01：APBCLK/2 */
#define	ADC_CFGR_CKS_APBCLK_4	(0x2U << ADC_CFGR_CKS_Pos)	/* 10：APBCLK/4 */
#define	ADC_CFGR_CKS_APBCLK	(0x3U << ADC_CFGR_CKS_Pos)	/* 11：APBCLK */

#define	ADC_CFGR_AWDCH_Pos	26	/* 模拟窗口看门狗监视通道选择，仅在AWDSC=1时有效 (Analog Watchdog Channel Select) */
#define	ADC_CFGR_AWDCH_Msk	(0xfU << ADC_CFGR_AWDCH_Pos)
#define	ADC_CFGR_AWDCH_ADC_IN0	(0x0U << ADC_CFGR_AWDCH_Pos)	/* 0000：AWD监视ADC_IN0 */
#define	ADC_CFGR_AWDCH_ADC_IN1	(0x1U << ADC_CFGR_AWDCH_Pos)	/* 0001：AWD监视ADC_IN1 */
#define	ADC_CFGR_AWDCH_ADC_IN2	(0x2U << ADC_CFGR_AWDCH_Pos)	/* 0010：AWD监视ADC_IN2 */
#define	ADC_CFGR_AWDCH_ADC_IN3	(0x3U << ADC_CFGR_AWDCH_Pos)	/* 0011：AWD监视ADC_IN3 */
#define	ADC_CFGR_AWDCH_ADC_IN4	(0x4U << ADC_CFGR_AWDCH_Pos)	/* 0100：AWD监视ADC_IN4 */
#define	ADC_CFGR_AWDCH_ADC_IN5	(0x5U << ADC_CFGR_AWDCH_Pos)	/* 0101：AWD监视ADC_IN5 */
#define	ADC_CFGR_AWDCH_ADC_IN6	(0x6U << ADC_CFGR_AWDCH_Pos)	/* 0110：AWD监视ADC_IN6 */
#define	ADC_CFGR_AWDCH_ADC_IN7	(0x7U << ADC_CFGR_AWDCH_Pos)	/* 0111：AWD监视ADC_IN7 */
#define	ADC_CFGR_AWDCH_ADC_IN8	(0x8U << ADC_CFGR_AWDCH_Pos)	/* 1000：AWD监视ADC_IN8 */
#define	ADC_CFGR_AWDCH_ADC_IN9	(0x9U << ADC_CFGR_AWDCH_Pos)	/* 1001：AWD监视ADC_IN9 */
#define	ADC_CFGR_AWDCH_ADC_IN10	(0xaU << ADC_CFGR_AWDCH_Pos)	/* 1010：AWD监视ADC_IN10 */
#define	ADC_CFGR_AWDCH_ADC_IN11	(0xbU << ADC_CFGR_AWDCH_Pos)	/* 1011：AWD监视ADC_IN11 */

#define	ADC_CFGR_AWDSC_Pos	25	/* 模拟窗口看门狗单通道或全通道选择 (Analog Watchdog Single Channel mode) */
#define	ADC_CFGR_AWDSC_Msk	(0x1U << ADC_CFGR_AWDSC_Pos)
#define	ADC_CFGR_AWDSC_AWD_ALL	(0x0U << ADC_CFGR_AWDSC_Pos)	/* 0：AWD监视所有被使能的外部输入通道 */
#define	ADC_CFGR_AWDSC_AWD_SINGLE	(0x1U << ADC_CFGR_AWDSC_Pos)	/* 1：AWD监视AWDCH指定的单个通道 */

#define	ADC_CFGR_AWDEN_Pos	24	/* 模拟窗口看门狗使能寄存器 (Analog Watchdog Enable) 0：关闭AWD 1：使能AWD 仅能在START=0的情况下使能AWD */
#define	ADC_CFGR_AWDEN_Msk	(0x1U << ADC_CFGR_AWDEN_Pos)

#define	ADC_CFGR_OVSS_Pos	20	/* 过采样移位控制寄存器 (Oversampling Shift) */
#define	ADC_CFGR_OVSS_Msk	(0xfU << ADC_CFGR_OVSS_Pos)
#define	ADC_CFGR_OVSS_R_SHIFT_0	(0x0U << ADC_CFGR_OVSS_Pos)	/* 0000：不移位 */
#define	ADC_CFGR_OVSS_R_SHIFT_1	(0x1U << ADC_CFGR_OVSS_Pos)	/* 0001：右移1bit */
#define	ADC_CFGR_OVSS_R_SHIFT_2	(0x2U << ADC_CFGR_OVSS_Pos)	/* 0010：右移2bit */
#define	ADC_CFGR_OVSS_R_SHIFT_3	(0x3U << ADC_CFGR_OVSS_Pos)	/* 0011：右移3bit */
#define	ADC_CFGR_OVSS_R_SHIFT_4	(0x4U << ADC_CFGR_OVSS_Pos)	/* 0100：右移4bit */
#define	ADC_CFGR_OVSS_R_SHIFT_5	(0x5U << ADC_CFGR_OVSS_Pos)	/* 0101：右移5bit */
#define	ADC_CFGR_OVSS_R_SHIFT_6	(0x6U << ADC_CFGR_OVSS_Pos)	/* 0110：右移6bit */
#define	ADC_CFGR_OVSS_R_SHIFT_7	(0x7U << ADC_CFGR_OVSS_Pos)	/* 0111：右移7bit */
#define	ADC_CFGR_OVSS_R_SHIFT_8	(0x8U << ADC_CFGR_OVSS_Pos)	/* 1000：右移8bit */

#define	ADC_CFGR_OVSR_Pos	17	/* 过采样率控制 (Oversampling Ratio) */
#define	ADC_CFGR_OVSR_Msk	(0x7U << ADC_CFGR_OVSR_Pos)
#define	ADC_CFGR_OVSR_2x	(0x0U << ADC_CFGR_OVSR_Pos)	/* 000：2x */
#define	ADC_CFGR_OVSR_4x	(0x1U << ADC_CFGR_OVSR_Pos)	/* 001：4x */
#define	ADC_CFGR_OVSR_8x	(0x2U << ADC_CFGR_OVSR_Pos)	/* 010：8x */
#define	ADC_CFGR_OVSR_16x	(0x3U << ADC_CFGR_OVSR_Pos)	/* 011：16x */
#define	ADC_CFGR_OVSR_32x	(0x4U << ADC_CFGR_OVSR_Pos)	/* 100：32x */
#define	ADC_CFGR_OVSR_64x	(0x5U << ADC_CFGR_OVSR_Pos)	/* 101：64x */
#define	ADC_CFGR_OVSR_128x	(0x6U << ADC_CFGR_OVSR_Pos)	/* 110：128x */
#define	ADC_CFGR_OVSR_256x	(0x7U << ADC_CFGR_OVSR_Pos)	/* 111：256x */

#define	ADC_CFGR_OVSEN_Pos	16	/* 过采样使能 (Oversampling Enable) 0：禁止过采样 1：使能过采样 */
#define	ADC_CFGR_OVSEN_Msk	(0x1U << ADC_CFGR_OVSEN_Pos)

#define	ADC_CFGR_IOTRFEN_Pos	14	/* 引脚触发信号数字滤波使能 (GPIO Trigger Filter Enable) 0：禁止数字滤波 1：使能数字滤波  */
#define	ADC_CFGR_IOTRFEN_Msk	(0x1U << ADC_CFGR_IOTRFEN_Pos)

#define	ADC_CFGR_TRGCFG_Pos	12	/* 触发信号使能和极性选择 (Trigger Config) */
#define	ADC_CFGR_TRGCFG_Msk	(0x3U << ADC_CFGR_TRGCFG_Pos)
#define	ADC_CFGR_TRGCFG_DISABLE	(0x0U << ADC_CFGR_TRGCFG_Pos)	/* 00：禁止触发 */
#define	ADC_CFGR_TRGCFG_RISING	(0x1U << ADC_CFGR_TRGCFG_Pos)	/* 01：上升沿触发 */
#define	ADC_CFGR_TRGCFG_FALLING	(0x2U << ADC_CFGR_TRGCFG_Pos)	/* 10：下降沿触发 */
#define	ADC_CFGR_TRGCFG_BOTH	(0x3U << ADC_CFGR_TRGCFG_Pos)	/* 11：上升、下降沿都触发 */

