wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_adc.h
#define	ADC_CFGR_SEMI_Pos	11	/* 单次转换半自动模式 (Semi-automatic)，仅在单次转换（CONT=0）时有效 */
#define	ADC_CFGR_SEMI_Msk	(0x1U << ADC_CFGR_SEMI_Pos)
#define	ADC_CFGR_SEMI_AUTO	(0x0U << ADC_CFGR_SEMI_Pos)	/* 0：自动模式 */
#define	ADC_CFGR_SEMI_HALF_AUTO	(0x1U << ADC_CFGR_SEMI_Pos)	/* 1：半自动模式 */

#define	ADC_CFGR_WAIT_Pos	10	/* 等待模式控制 (wait mode) 0：无等待，如果上次转换数据没有及时读取，则可能出现Overrun 1：等待模式，在上次转换数据被读取前，不会启动下一次转换 */
#define	ADC_CFGR_WAIT_Msk	(0x1U << ADC_CFGR_WAIT_Pos)

#define	ADC_CFGR_CONT_Pos	9	/* 连续转换模式使能 (Continuous mode) 0：单次转换 1：连续转换  */
#define	ADC_CFGR_CONT_Msk	(0x1U << ADC_CFGR_CONT_Pos)

#define	ADC_CFGR_OVRM_Pos	8	/* Overrun模式控制 (Overrun mode) */
#define	ADC_CFGR_OVRM_Msk	(0x1U << ADC_CFGR_OVRM_Pos)
#define	ADC_CFGR_OVRM_KEEP	(0x0U << ADC_CFGR_OVRM_Pos)	/* 0：当overrun发生时，保持上次数据，丢弃本次转换值 */
#define	ADC_CFGR_OVRM_COVER	(0x1U << ADC_CFGR_OVRM_Pos)	/* 1：当overrun发生时，覆盖上次数据 */

#define	ADC_CFGR_EXTS_Pos	4	/* 硬件触发源选择 (External trigger select) */
#define	ADC_CFGR_EXTS_Msk	(0xfU << ADC_CFGR_EXTS_Pos)
#define	ADC_CFGR_EXTS_PA8	(0x0U << ADC_CFGR_EXTS_Pos)	/* 0000：PA8 */
#define	ADC_CFGR_EXTS_PB9	(0x1U << ADC_CFGR_EXTS_Pos)	/* 0001：PB9 */
#define	ADC_CFGR_EXTS_ATIM_TROG	(0x3U << ADC_CFGR_EXTS_Pos)	/* 0011：ATIM_TRGO */
#define	ADC_CFGR_EXTS_GPTIM1_TROG	(0x4U << ADC_CFGR_EXTS_Pos)	/* 0100：GPTIM1_TRGO */
#define	ADC_CFGR_EXTS_GPTIM2_TROG	(0x5U << ADC_CFGR_EXTS_Pos)	/* 0101：GPTIM2_TRGO */
#define	ADC_CFGR_EXTS_RTC_TROG	(0x7U << ADC_CFGR_EXTS_Pos)	/* 0111：RTC_TRGO */
#define	ADC_CFGR_EXTS_BSTIM1_TROG	(0x8U << ADC_CFGR_EXTS_Pos)	/* 1000：BSTIM1_TRGO */
#define	ADC_CFGR_EXTS_COMP1_TROG	(0xaU << ADC_CFGR_EXTS_Pos)	/* 1010：COMP1_TRGO */
#define	ADC_CFGR_EXTS_COMP2_TROG	(0xbU << ADC_CFGR_EXTS_Pos)	/* 1011：COMP2_TRGO */

#define	ADC_CFGR_LPM_Pos	3	/* ADC低功耗模式使能，软件可以配置 (Low Power Mode) */
#define	ADC_CFGR_LPM_Msk	(0x1U << ADC_CFGR_LPM_Pos)
#define	ADC_CFGR_LPM_LPM_MODE	(0x0U << ADC_CFGR_LPM_Pos)	/* 0：正常模式 */
#define	ADC_CFGR_LPM_NORMAL_MODE	(0x1U << ADC_CFGR_LPM_Pos)	/* 1：使能ADC低功耗模式，最大工作时钟频率4MHz，最高采样率250Ksps */

#define	ADC_CFGR_SCANDIR_Pos	2	/* 通道扫描顺序控制 (Scan Direction)（共16个通道，实际只会采样被使能的通道） */
#define	ADC_CFGR_SCANDIR_Msk	(0x1U << ADC_CFGR_SCANDIR_Pos)
#define	ADC_CFGR_SCANDIR_FORWARD	(0x0U << ADC_CFGR_SCANDIR_Pos)	/* 0：前向扫描，ADC_IN0->ADC_IN11->REF->TS->OPA1->OPA2 */
#define	ADC_CFGR_SCANDIR_REVERSE	(0x1U << ADC_CFGR_SCANDIR_Pos)	/* 1：反向扫描，OPA2->OPA1->TS->REF->ADC_IN11->ADC_IN0 */

#define	ADC_CFGR_DMACFG_Pos	1	/* DMA模式控制 (DMA Config) */
#define	ADC_CFGR_DMACFG_Msk	(0x1U << ADC_CFGR_DMACFG_Pos)
#define	ADC_CFGR_DMACFG_SINGLE	(0x0U << ADC_CFGR_DMACFG_Pos)	/* 0：单次模式 */
#define	ADC_CFGR_DMACFG_CYCLE	(0x1U << ADC_CFGR_DMACFG_Pos)	/* 1：循环模式 */

#define	ADC_CFGR_DMAEN_Pos	0	/* DMA使能 (DMA Enable) 0：禁止DMA 1：使能DMA  */
#define	ADC_CFGR_DMAEN_Msk	(0x1U << ADC_CFGR_DMAEN_Pos)

#define	ADC_SMTR_CHCG_Pos	8	/* ADC采样通道切换等待时间 (Channel Clock Gating) 在当前通道采样周期完成后，等待CHCG时间（CHCG*ADC工作时钟周期），再切换到下一个采样通道 */
#define	ADC_SMTR_CHCG_Msk	(0xfU << ADC_SMTR_CHCG_Pos)
#define	ADC_SMTR_CHCG_1_TADCCLK	(0x0U << ADC_SMTR_CHCG_Pos)	/* 0000, 0001：1*TADCLK */
#define	ADC_SMTR_CHCG_2_TADCCLK	(0x2U << ADC_SMTR_CHCG_Pos)	/* 0010：2*TADCLK */
#define	ADC_SMTR_CHCG_3_TADCCLK	(0x3U << ADC_SMTR_CHCG_Pos)	/* 0011：3*TADCLK */
#define	ADC_SMTR_CHCG_4_TADCCLK	(0x4U << ADC_SMTR_CHCG_Pos)	/* 0100：4*TADCLK */
#define	ADC_SMTR_CHCG_5_TADCCLK	(0x5U << ADC_SMTR_CHCG_Pos)	/* 0101：5*TADCLK */
#define	ADC_SMTR_CHCG_6_TADCCLK	(0x6U << ADC_SMTR_CHCG_Pos)	/* 0110：6*TADCLK */
#define	ADC_SMTR_CHCG_7_TADCCLK	(0x7U << ADC_SMTR_CHCG_Pos)	/* 0111：7*TADCLK */
#define	ADC_SMTR_CHCG_8_TADCCLK	(0x8U << ADC_SMTR_CHCG_Pos)	/* 1000：8*TADCLK */
#define	ADC_SMTR_CHCG_9_TADCCLK	(0x9U << ADC_SMTR_CHCG_Pos)	/* 1001：9*TADCLK */
#define	ADC_SMTR_CHCG_10_TADCCLK	(0xaU << ADC_SMTR_CHCG_Pos)	/* 1010：10*TADCLK */
#define	ADC_SMTR_CHCG_11_TADCCLK	(0xbU << ADC_SMTR_CHCG_Pos)	/* 1011~1111：11*TADCLK */

#define	ADC_SMTR_SMTS2_Pos	4	/* 慢速通道采样时间控制（*ADC工作时钟周期），用于配置ADC_IN8/9/10/11四个外部通道、以及OPA通道的采样时间 (Sampling Time Select 2)  */
#define	ADC_SMTR_SMTS2_Msk	(0x3U << ADC_SMTR_SMTS2_Pos)
#define	ADC_SMTR_SMTS2_3_5_TMCLK	(0x0U << ADC_SMTR_SMTS2_Pos)	/* 00：3.5*TMCLK */
#define	ADC_SMTR_SMTS2_4_5_TMCLK	(0x1U << ADC_SMTR_SMTS2_Pos)	/* 01：4.5*TMCLK */
#define	ADC_SMTR_SMTS2_6_5_TMCLK	(0x2U << ADC_SMTR_SMTS2_Pos)	/* 10：6.5*TMCLK */
#define	ADC_SMTR_SMTS2_10_5_TMCLK	(0x3U << ADC_SMTR_SMTS2_Pos)	/* 11：10.5*TMCLK */

#define	ADC_SMTR_SMTS1_Pos	0	/* 快速通道采样时间控制（*ADC工作时钟周期），用于配置ADC_IN8/9/10/11四个外部通道、以及OPA通道的采样时间 (Sampling Time Select 2)  */
#define	ADC_SMTR_SMTS1_Msk	(0x3U << ADC_SMTR_SMTS1_Pos)
#define	ADC_SMTR_SMTS1_3_5_TMCLK	(0x0U << ADC_SMTR_SMTS1_Pos)	/* 00：3.5*TMCLK */
#define	ADC_SMTR_SMTS1_4_5_TMCLK	(0x1U << ADC_SMTR_SMTS1_Pos)	/* 01：4.5*TMCLK */
#define	ADC_SMTR_SMTS1_6_5_TMCLK	(0x2U << ADC_SMTR_SMTS1_Pos)	/* 10：6.5*TMCLK */
#define	ADC_SMTR_SMTS1_10_5_TMCLK	(0x3U << ADC_SMTR_SMTS1_Pos)	/* 11：10.5*TMCLK */

#define	ADC_CHER_AINS_Pos	24	/* 单端和差分通道配置，4bit配置4组通道对是否为差分输入，0表示单端输入，1表示差分输入。(Analog Input Select)如果配置为差分输入，则每个差分对所对应的通道都要使能。
比如，将ADC_IN0和ADC_IN1设置为差分输入对，需要进行差分采样时，ECH0和ECH1都要置1。 */
#define	ADC_CHER_AINS_Msk	(0xfU << ADC_CHER_AINS_Pos)
#define	ADC_CHER_AINS_ADC_IN01	(0x1U << ADC_CHER_AINS_Pos)	/* 配置ADC_IN0和ADC_IN1为差分输出 */
#define	ADC_CHER_AINS_ADC_IN23	(0x2U << ADC_CHER_AINS_Pos)	/* 配置ADC_IN2和ADC_IN3为差分输出 */
#define	ADC_CHER_AINS_ADC_IN45	(0x4U << ADC_CHER_AINS_Pos)	/* 配置ADC_IN4和ADC_IN5为差分输出 */
#define	ADC_CHER_AINS_ADC_IN67	(0x8U << ADC_CHER_AINS_Pos)	/* 配置ADC_IN6和ADC_IN7为差分输出 */

#define	ADC_CHER_OPA2CH_Pos	19	/* OPA2输出测量，写1使能 (OPA2 channel)  */
#define	ADC_CHER_OPA2CH_Msk	(0x1U << ADC_CHER_OPA2CH_Pos)

#define	ADC_CHER_OPA1CH_Pos	18	/* OPA1输出测量，写1使能 (OPA1 channel)  */
#define	ADC_CHER_OPA1CH_Msk	(0x1U << ADC_CHER_OPA1CH_Pos)

#define	ADC_CHER_TSCH_Pos	17	/* 温度传感器测量通道，写1使能 (TempSensor channel)  */
#define	ADC_CHER_TSCH_Msk	(0x1U << ADC_CHER_TSCH_Pos)

#define	ADC_CHER_REFCH_Pos	16	/* 内部基准电压测量通道，写1使能 (VREF channel)  */
#define	ADC_CHER_REFCH_Msk	(0x1U << ADC_CHER_REFCH_Pos)

#define	ADC_CHER_ECH11_Pos	11	/* ADC_IN11 测量通道，写1使能  */
#define	ADC_CHER_ECH11_Msk	(0x1U << ADC_CHER_ECH11_Pos)

#define	ADC_CHER_ECH10_Pos	10	/* ADC_IN10 测量通道，写1使能  */
#define	ADC_CHER_ECH10_Msk	(0x1U << ADC_CHER_ECH10_Pos)

#define	ADC_CHER_ECH9_Pos	9	/* ADC_IN9 测量通道，写1使能 */
#define	ADC_CHER_ECH9_Msk	(0x1U << ADC_CHER_ECH9_Pos)

#define	ADC_CHER_ECH8_Pos	8	/* ADC_IN8 测量通道，写1使能 */
#define	ADC_CHER_ECH8_Msk	(0x1U << ADC_CHER_ECH8_Pos)

#define	ADC_CHER_ECH7_Pos	7	/* ADC_IN7 测量通道，写1使能 */
#define	ADC_CHER_ECH7_Msk	(0x1U << ADC_CHER_ECH7_Pos)

#define	ADC_CHER_ECH6_Pos	6	/* ADC_IN6 测量通道，写1使能 */
#define	ADC_CHER_ECH6_Msk	(0x1U << ADC_CHER_ECH6_Pos)

#define	ADC_CHER_ECH5_Pos	5	/* ADC_IN5 测量通道，写1使能 */
#define	ADC_CHER_ECH5_Msk	(0x1U << ADC_CHER_ECH5_Pos)

#define	ADC_CHER_ECH4_Pos	4	/* ADC_IN4 测量通道，写1使能 */
#define	ADC_CHER_ECH4_Msk	(0x1U << ADC_CHER_ECH4_Pos)

#define	ADC_CHER_ECH3_Pos	3	/* ADC_IN3 测量通道，写1使能 */
#define	ADC_CHER_ECH3_Msk	(0x1U << ADC_CHER_ECH3_Pos)

#define	ADC_CHER_ECH2_Pos	2	/* ADC_IN2 测量通道，写1使能 */
#define	ADC_CHER_ECH2_Msk	(0x1U << ADC_CHER_ECH2_Pos)

