wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_adc.h
#define	ADC_CHER_ECH1_Pos	1	/* ADC_IN1 测量通道，写1使能 */
#define	ADC_CHER_ECH1_Msk	(0x1U << ADC_CHER_ECH1_Pos)

#define	ADC_CHER_ECH0_Pos	0	/* ADC_IN0 测量通道，写1使能 */
#define	ADC_CHER_ECH0_Msk	(0x1U << ADC_CHER_ECH0_Pos)

#define	ADC_DR_ADC_DATA_Pos	0	/* ADC转换结果 (ADC conversion data)在没有使能过采样平均的情况下，结果为低12bit；在使能过采样平均的情况下，结果为12~16bit
 */
#define	ADC_DR_ADC_DATA_Msk	(0xffffU << ADC_DR_ADC_DATA_Pos)

#define	ADC_CAL_CONV_CAL_Pos	1	/* ADC转换配置 (Conversion with Calibration data) */
#define	ADC_CAL_CONV_CAL_Msk	(0x1U << ADC_CAL_CONV_CAL_Pos)
#define	ADC_CAL_CONV_CAL_UNUSE_CAL	(0x0U << ADC_CAL_CONV_CAL_Pos)	/* 0：ADC转换时不使用校准寄存器的数据 */
#define	ADC_CAL_CONV_CAL_USE_CAL	(0x1U << ADC_CAL_CONV_CAL_Pos)	/* 1：ADC转换时使用校准寄存器的数据 */

#define	ADC_CAL_CALEN_Pos	0	/* Calibration使能 (Calibration Enable)软件写1启动校准周期，硬件开始校准后自动清零。软件通过EOCAL寄存器查询校准周期结束 */
#define	ADC_CAL_CALEN_Msk	(0x1U << ADC_CAL_CALEN_Pos)

#define	ADC_HLTR_AWD_HT_Pos	16	/* AWD监视高阈值 (Analog Watchdog High Threshold) */
#define	ADC_HLTR_AWD_HT_Msk	(0xfffU << ADC_HLTR_AWD_HT_Pos)

#define	ADC_HLTR_AWD_LT_Pos	0	/* AWD监视低阈值 (Analog Watchdog Low Threshold) */
#define	ADC_HLTR_AWD_LT_Msk	(0xfffU << ADC_HLTR_AWD_LT_Pos)
//Macro_End

/* Exported functions --------------------------------------------------------*/ 
extern void ADC_Deinit(void);

/* 模拟看门狗超出上限中断标志 (Analog Watchdog Above High Threshold)当采样值高于AWD_HT时，硬件置位，软件写1清零. 相关函数 */
extern void ADC_ISR_AWD_AH_Clr(void);
extern FlagStatus ADC_ISR_AWD_AH_Chk(void);

/* 模拟看门狗低于下限中断标志 (Analog Watchdog Under Low Threshold)当采样值低于AWD_LT时，硬件置位，软件写1清零 相关函数 */
extern void ADC_ISR_AWD_UL_Clr(void);
extern FlagStatus ADC_ISR_AWD_UL_Chk(void);

/* 校准结束 (End Of Calibration)硬件置位，软件写1清零1：校准过程结束0：无校准过程 相关函数 */
extern void ADC_ISR_EOCAL_Clr(void);
extern FlagStatus ADC_ISR_EOCAL_Chk(void);

/* ADC忙标志 (Busy) 1：ADC正在校准、采样或转换过程中 0：ADC空闲 相关函数 */
extern FlagStatus ADC_ISR_BUSY_Chk(void);

/* 数据冲突标志，硬件置位，软件写1清零 (Over Run) 当ADC_DATA寄存器中的上一次转换结果还未被读取，新的转换结果又到来时，硬件置位OVR标志。0：没有数据冲突 1：出现数据冲突 相关函数 */
extern void ADC_ISR_OVR_Clr(void);
extern FlagStatus ADC_ISR_OVR_Chk(void);

/* 转换序列结束 (End Of Sequence)所有使能通道都转换完成后，置位EOS，软件写1清零。 相关函数 */
extern void ADC_ISR_EOS_Clr(void);
extern FlagStatus ADC_ISR_EOS_Chk(void);

/* 单次转换结束 (End Of Conversion)每个通道转换完成后，置位EOC，软件写1清零。 相关函数 */
extern void ADC_ISR_EOC_Clr(void);
extern FlagStatus ADC_ISR_EOC_Chk(void);

/* 模拟看门狗采样值高于上限中断使能，1有效 (Analog Watchdog Above High Threshold Interrupt Enable) 相关函数 */
extern void ADC_IER_AWD_AHIE_Setable(FunState NewState);
extern FunState ADC_IER_AWD_AHIE_Getable(void);

/* 模拟看门狗采样值低于上限中断使能，1有效 (Analog Watchdog Under Low Threshold Interrupt Enable) 相关函数 */
extern void ADC_IER_AWD_ULIE_Setable(FunState NewState);
extern FunState ADC_IER_AWD_ULIE_Getable(void);

/* 校准结束中断使能寄存器 (End Of Calibration Interrupt Enable) 0：禁止EOCAL中断 1：允许EOCAL中断 相关函数 */
extern void ADC_IER_EOCALIE_Setable(FunState NewState);
extern FunState ADC_IER_EOCALIE_Getable(void);

/* 数据冲突中断使能寄存器 (Over Run Interrupt Enable) 0：禁止数据冲突中断 1：允许数据冲突中断 相关函数 */
extern void ADC_IER_OVRIE_Setable(FunState NewState);
extern FunState ADC_IER_OVRIE_Getable(void);

/* 转换序列结束中断使能寄存器 (End Of Sequence Interrupt Enable) 0：禁止EOS中断 1：允许EOS中断 相关函数 */
extern void ADC_IER_EOSIE_Setable(FunState NewState);
extern FunState ADC_IER_EOSIE_Getable(void);

/* 单次转换结束中断使能寄存器 (End Of Conversion Interrupt Enable) 0：禁止EOC中断 1：允许EOC中断 相关函数 */
extern void ADC_IER_EOCIE_Setable(FunState NewState);
extern FunState ADC_IER_EOCIE_Getable(void);

/* ADC启动转换寄存器，软件写1启动，硬件自动清零。 相关函数 */
extern void ADC_CR_START_Setable(FunState NewState);
extern FunState ADC_CR_START_Getable(void);

/* ADC使能寄存器 (ADC Enable) 在启动转换前先要置位ADEN，等待至少5个MCLK后再启动转换。0：关闭ADC 1：使能ADC 相关函数 */
extern void ADC_CR_ADEN_Setable(FunState NewState);
extern FunState ADC_CR_ADEN_Getable(void);

/* ADC工作时钟选择 (ADC Clock Select) 相关函数 */
extern void ADC_CFGR_CKS_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_CKS_Get(void);

/* 模拟窗口看门狗监视通道选择，仅在AWDSC=1时有效 (Analog Watchdog Channel Select) 相关函数 */
extern void ADC_CFGR_AWDCH_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_AWDCH_Get(void);

/* 模拟窗口看门狗单通道或全通道选择 (Analog Watchdog Single Channel mode) 相关函数 */
extern void ADC_CFGR_AWDSC_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_AWDSC_Get(void);

/* 模拟窗口看门狗使能寄存器 (Analog Watchdog Enable) 0：关闭AWD 1：使能AWD 仅能在START=0的情况下使能AWD 相关函数 */
extern void ADC_CFGR_AWDEN_Setable(FunState NewState);
extern FunState ADC_CFGR_AWDEN_Getable(void);

/* 过采样移位控制寄存器 (Oversampling Shift) 相关函数 */
extern void ADC_CFGR_OVSS_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_OVSS_Get(void);

/* 过采样率控制 (Oversampling Ratio) 相关函数 */
extern void ADC_CFGR_OVSR_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_OVSR_Get(void);

/* 过采样使能 (Oversampling Enable) 0：禁止过采样 1：使能过采样 相关函数 */
extern void ADC_CFGR_OVSEN_Setable(FunState NewState);
extern FunState ADC_CFGR_OVSEN_Getable(void);

/* 引脚触发信号数字滤波使能 (GPIO Trigger Filter Enable) 0：禁止数字滤波 1：使能数字滤波  相关函数 */
extern void ADC_CFGR_IOTRFEN_Setable(FunState NewState);
extern FunState ADC_CFGR_IOTRFEN_Getable(void);

/* 触发信号使能和极性选择 (Trigger Config) 相关函数 */
extern void ADC_CFGR_TRGCFG_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_TRGCFG_Get(void);

/* 单次转换半自动模式 (Semi-automatic)，仅在单次转换（CONT=0）时有效 相关函数 */
extern void ADC_CFGR_SEMI_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_SEMI_Get(void);

/* 等待模式控制 (wait mode) 0：无等待，如果上次转换数据没有及时读取，则可能出现Overrun 1：等待模式，在上次转换数据被读取前，不会启动下一次转换 相关函数 */
extern void ADC_CFGR_WAIT_Setable(FunState NewState);
extern FunState ADC_CFGR_WAIT_Getable(void);

/* 连续转换模式使能 (Continuous mode) 0：单次转换 1：连续转换  相关函数 */
extern void ADC_CFGR_CONT_Setable(FunState NewState);
extern FunState ADC_CFGR_CONT_Getable(void);

/* Overrun模式控制 (Overrun mode) 相关函数 */
extern void ADC_CFGR_OVRM_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_OVRM_Get(void);

/* 硬件触发源选择 (External trigger select) 相关函数 */
extern void ADC_CFGR_EXTS_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_EXTS_Get(void);

/* ADC低功耗模式使能，软件可以配置 (Low Power Mode) 相关函数 */
extern void ADC_CFGR_LPM_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_LPM_Get(void);

