wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_adc.h
/* 通道扫描顺序控制 (Scan Direction)（共16个通道，实际只会采样被使能的通道） 相关函数 */
extern void ADC_CFGR_SCANDIR_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_SCANDIR_Get(void);

/* DMA模式控制 (DMA Config) 相关函数 */
extern void ADC_CFGR_DMACFG_Set(uint32_t SetValue);
extern uint32_t ADC_CFGR_DMACFG_Get(void);

/* DMA使能 (DMA Enable) 0：禁止DMA 1：使能DMA  相关函数 */
extern void ADC_CFGR_DMAEN_Setable(FunState NewState);
extern FunState ADC_CFGR_DMAEN_Getable(void);

/* ADC采样通道切换等待时间 (Channel Clock Gating) 在当前通道采样周期完成后，等待CHCG时间（CHCG*ADC工作时钟周期），再切换到下一个采样通道 相关函数 */
extern void ADC_SMTR_CHCG_Set(uint32_t SetValue);
extern uint32_t ADC_SMTR_CHCG_Get(void);

/* 慢速通道采样时间控制（*ADC工作时钟周期），用于配置ADC_IN8/9/10/11四个外部通道、以及OPA通道的采样时间 (Sampling Time Select 2)  相关函数 */
extern void ADC_SMTR_SMTS2_Set(uint32_t SetValue);
extern uint32_t ADC_SMTR_SMTS2_Get(void);

/* 快速通道采样时间控制（*ADC工作时钟周期），用于配置ADC_IN8/9/10/11四个外部通道、以及OPA通道的采样时间 (Sampling Time Select 2)  相关函数 */
extern void ADC_SMTR_SMTS1_Set(uint32_t SetValue);
extern uint32_t ADC_SMTR_SMTS1_Get(void);

/* 单端和差分通道配置，4bit配置4组通道对是否为差分输入，0表示单端输入，1表示差分输入。(Analog Input Select)如果配置为差分输入，则每个差分对所对应的通道都要使能。
比如，将ADC_IN0和ADC_IN1设置为差分输入对，需要进行差分采样时，ECH0和ECH1都要置1。 相关函数 */
extern void ADC_CHER_AINS_Set(uint32_t SetValue);
extern uint32_t ADC_CHER_AINS_Get(void);

/* OPA2输出测量，写1使能 (OPA2 channel)  相关函数 */
extern void ADC_CHER_OPA2CH_Setable(FunState NewState);
extern FunState ADC_CHER_OPA2CH_Getable(void);

/* OPA1输出测量，写1使能 (OPA1 channel)  相关函数 */
extern void ADC_CHER_OPA1CH_Setable(FunState NewState);
extern FunState ADC_CHER_OPA1CH_Getable(void);

/* 温度传感器测量通道，写1使能 (TempSensor channel)  相关函数 */
extern void ADC_CHER_TSCH_Setable(FunState NewState);
extern FunState ADC_CHER_TSCH_Getable(void);

/* 内部基准电压测量通道，写1使能 (VREF channel)  相关函数 */
extern void ADC_CHER_REFCH_Setable(FunState NewState);
extern FunState ADC_CHER_REFCH_Getable(void);

/* ADC_IN11 测量通道，写1使能  相关函数 */
extern void ADC_CHER_ECH11_Setable(FunState NewState);
extern FunState ADC_CHER_ECH11_Getable(void);

/* ADC_IN10 测量通道，写1使能  相关函数 */
extern void ADC_CHER_ECH10_Setable(FunState NewState);
extern FunState ADC_CHER_ECH10_Getable(void);

/* ADC_IN9 测量通道，写1使能 相关函数 */
extern void ADC_CHER_ECH9_Setable(FunState NewState);
extern FunState ADC_CHER_ECH9_Getable(void);

/* ADC_IN8 测量通道，写1使能 相关函数 */
extern void ADC_CHER_ECH8_Setable(FunState NewState);
extern FunState ADC_CHER_ECH8_Getable(void);

/* ADC_IN7 测量通道，写1使能 相关函数 */
extern void ADC_CHER_ECH7_Setable(FunState NewState);
extern FunState ADC_CHER_ECH7_Getable(void);

/* ADC_IN6 测量通道，写1使能 相关函数 */
extern void ADC_CHER_ECH6_Setable(FunState NewState);
extern FunState ADC_CHER_ECH6_Getable(void);

/* ADC_IN5 测量通道，写1使能 相关函数 */
extern void ADC_CHER_ECH5_Setable(FunState NewState);
extern FunState ADC_CHER_ECH5_Getable(void);

/* ADC_IN4 测量通道，写1使能 相关函数 */
extern void ADC_CHER_ECH4_Setable(FunState NewState);
extern FunState ADC_CHER_ECH4_Getable(void);

/* ADC_IN3 测量通道，写1使能 相关函数 */
extern void ADC_CHER_ECH3_Setable(FunState NewState);
extern FunState ADC_CHER_ECH3_Getable(void);

/* ADC_IN2 测量通道，写1使能 相关函数 */
extern void ADC_CHER_ECH2_Setable(FunState NewState);
extern FunState ADC_CHER_ECH2_Getable(void);

/* ADC_IN1 测量通道，写1使能 相关函数 */
extern void ADC_CHER_ECH1_Setable(FunState NewState);
extern FunState ADC_CHER_ECH1_Getable(void);

/* ADC_IN0 测量通道，写1使能 相关函数 */
extern void ADC_CHER_ECH0_Setable(FunState NewState);
extern FunState ADC_CHER_ECH0_Getable(void);

/* ADC转换结果 (ADC conversion data)在没有使能过采样平均的情况下，结果为低12bit；在使能过采样平均的情况下，结果为12~16bit
 相关函数 */
extern uint32_t ADC_DR_Read(void);

/* ADC转换配置 (Conversion with Calibration data) 相关函数 */
extern void ADC_CAL_CONV_CAL_Set(uint32_t SetValue);
extern uint32_t ADC_CAL_CONV_CAL_Get(void);

/* Calibration使能 (Calibration Enable)软件写1启动校准周期，硬件开始校准后自动清零。软件通过EOCAL寄存器查询校准周期结束 相关函数 */
extern void ADC_CAL_CALEN_Setable(FunState NewState);
extern FunState ADC_CAL_CALEN_Getable(void);

/* AWD监视高阈值 (Analog Watchdog High Threshold) 相关函数 */
extern void ADC_HLTR_AWD_HT_Set(uint32_t SetValue);
extern uint32_t ADC_HLTR_AWD_HT_Get(void);

/* AWD监视低阈值 (Analog Watchdog Low Threshold) 相关函数 */
extern void ADC_HLTR_AWD_LT_Set(uint32_t SetValue);
extern uint32_t ADC_HLTR_AWD_LT_Get(void);

#ifdef __cplusplus
}
#endif

#endif /* __FM33L0XX_ADC_H */



/************************ (C) COPYRIGHT FMSHelectronics *****END OF FILE****/
